In [1]:
import pandas as pd
import numpy as np
pd.isnull(np.nan)

True

In [3]:
pd.isna(np.nan)

True

In [4]:
pd.notnull(np.nan)

False

In [5]:
s=pd.Series([1,2,np.nan,np.nan,3,4])
s.isnull()

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

In [8]:
pd.isnull(pd.Series([2,3,np.nan]))

0    False
1    False
2     True
dtype: bool

In [9]:
pd.isnull(s)

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

In [27]:
a=pd.DataFrame({
    "a":[1,3,np.nan,np.nan],
    "b":["we","u",np.nan,np.nan],
    "c":[np.nan  ,56.7,89.0,56.0],
})
a

     a    b     c
0  1.0   we   NaN
1  3.0    u  56.7
2  NaN  NaN  89.0
3  NaN  NaN  56.0

In [28]:
pd.isnull(a)

       a      b      c
0  False  False   True
1  False  False  False
2   True   True  False
3   True   True  False

In [29]:
pd.notnull(a).count()

a    4
b    4
c    4
dtype: int64

In [30]:
pd.notnull(a).sum()

a    2
b    2
c    3
dtype: int64

In [31]:
a.dropna()

     a  b     c
1  3.0  u  56.7

In [32]:
a.dropna(how="all")

     a    b     c
0  1.0   we   NaN
1  3.0    u  56.7
2  NaN  NaN  89.0
3  NaN  NaN  56.0

In [33]:
a.dropna(how="any")

     a  b     c
1  3.0  u  56.7

In [35]:
a.dropna(thresh=2)

     a   b     c
0  1.0  we   NaN
1  3.0   u  56.7

In [36]:
a.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [37]:
a.dropna(axis=0)

     a  b     c
1  3.0  u  56.7

In [40]:
a.dropna(thresh=3,axis=1)

      c
0   NaN
1  56.7
2  89.0
3  56.0

In [41]:
s

0    1.0
1    2.0
2    NaN
3    NaN
4    3.0
5    4.0
dtype: float64

In [42]:
a

     a    b     c
0  1.0   we   NaN
1  3.0    u  56.7
2  NaN  NaN  89.0
3  NaN  NaN  56.0

In [43]:
a.fillna(0)

     a   b     c
0  1.0  we   0.0
1  3.0   u  56.7
2  0.0   0  89.0
3  0.0   0  56.0

In [44]:
a.fillna("c")

     a   b     c
0  1.0  we     c
1  3.0   u  56.7
2    c   c  89.0
3    c   c  56.0

In [46]:
s.fillna(s.mean())

0    1.0
1    2.0
2    2.5
3    2.5
4    3.0
5    4.0
dtype: float64

In [47]:
s.fillna(s.sum())

0     1.0
1     2.0
2    10.0
3    10.0
4     3.0
5     4.0
dtype: float64

In [48]:
s.fillna(s.count())

0    1.0
1    2.0
2    4.0
3    4.0
4    3.0
5    4.0
dtype: float64

In [50]:
s.fillna(method="ffill")

0    1.0
1    2.0
2    2.0
3    2.0
4    3.0
5    4.0
dtype: float64

In [52]:
s.fillna(method="bfill")

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [53]:
a

     a    b     c
0  1.0   we   NaN
1  3.0    u  56.7
2  NaN  NaN  89.0
3  NaN  NaN  56.0

In [54]:
a.fillna(method="ffill")

     a   b     c
0  1.0  we   NaN
1  3.0   u  56.7
2  3.0   u  89.0
3  3.0   u  56.0

In [55]:
a.fillna(method="bfill")

     a    b     c
0  1.0   we  56.7
1  3.0    u  56.7
2  NaN  NaN  89.0
3  NaN  NaN  56.0

In [57]:
a.fillna(method="ffill",axis=1)

     a    b     c
0  1.0   we    we
1  3.0    u  56.7
2  NaN  NaN  89.0
3  NaN  NaN  56.0

In [61]:
len(s)

6

In [59]:
s.count()!=len(s)

True

In [60]:
s.count()

4

In [64]:
pd.Series(["True","False","False"]).all()

True

In [66]:
d=pd.DataFrame({
    "sex":["f","f","m","d","?","m"],
    "age":[20,34,5,6,78,240]
})
d

  sex  age
0   f   20
1   f   34
2   m    5
3   d    6
4   ?   78
5   m  240

In [68]:
d["sex"].unique()

array(['f', 'm', 'd', '?'], dtype=object)

In [69]:
d["sex"].value_counts()

f    2
m    2
d    1
?    1
Name: sex, dtype: int64

In [73]:
f=d["sex"].replace('d','f')

In [74]:
f=d["sex"].replace('?','f')

In [75]:
f

0    f
1    f
2    m
3    d
4    f
5    m
Name: sex, dtype: object